package utils

import (
	"math/rand"
)

func GetRandomNickname() string {
	nicknames := []string{
		"小兔", "蛋黄酥", "奶糖", "糯米团子", "芒果冰", "奶茶",
		"小甜心", "棉花糖", "蓝莓布丁", "糖豆",
		"蜜桃仙子", "小可爱", "蜜汁糖葫芦", "草莓蛋糕",
		"奇异果冰沙", "樱花泡芙", "抹茶红豆", "小橘子", "香蕉酥", "水蜜桃",
		"珍珠奶茶", "软糯甜筒", "杏仁曲奇", "蜜糖柚子",
		"草莓巧克力", "牛奶小饼干", "蜜桃凉粉", "巧克力酥球", "椰子树",
		"柠檬蛋挞", "蜜汁菠萝", "蓝莓芝士", "奇奇怪怪果冻", "绿色小葡萄",
		"香草冰淇淋", "奶黄包", "芝士薯片", "小鲸鱼",
		"榴莲糖", "红豆沙", "黑森林蛋糕", "脆皮炸鸡", "哈密瓜冰茶",
		"蔓越莓曲奇", "奶香葡萄干", "草莓玛奇朵", "爆米花",
		"蛋黄派", "牛奶软糖", "紫薯布丁", "可乐果冻", "葡萄柚汁",
		"小丸子", "网红", "阿飞", "小喵咪", "文艺青年", "格调", "暖阳", "吐槽王",
		"小野猫", "混迹者", "闲云野鹤", "懒癌晚期", "老干部", "奶油小生", "微笑天使",
		"快乐侠", "黑桃Ace", "初心者",
		"缘来如此", "小清新", "游戏玩家", "思维者",
		"匠人", "森林之子", "锐气", "眼镜男", "摄影师",
		"时尚达人", "自然主义", "慢活族", "独立思考", "不二神探",
		"小资", "创作者", "云游者", "美食家", "旅行达人",
		"品酒师", "画家", "宅舞者", "健身达人", "跳蚤市场", "剧情党",
		"音乐人", "手作达人", "文艺小清新", "设计师",
		"老司机", "资深玩家", "心灵鸡汤", "智者", "小贝壳", "沉稳", "生活行家", "老狼", "爱好者",
		"积极向上", "精神领袖", "滴水穿石", "构思家", "厨艺大师", "亲和者", "风度翩翩", "经验分享",
		"心灵导师", "文艺清新",
		"知识分子",
	}

	// random return nickname
	nickname := nicknames[rand.Intn(len(nicknames))]
	return nickname
}
